[
    {
        "name": "Villager who saved hunter",
        "dialogues": [
            {
                "dialogue": [
                    "Ahh... You're awake.",
                    "No no... You shouldn't get up yet. It's best if you rest for just a little whlie longer.",
                    "You fell from a cliff, but the snow must have cushioned your fall. You were bruised and suffered a bit of frostbite, so recovery will take a few days.",
                    "I'm not so much worried about the bruise on your back as much the bruise to your ego...",
                    "You are definitely going to need some extra days of rest!"
                ],
                "note": "the first dialogue",
                "rewards": []
            },
            {
                "dialogue": [
                    "Ahh... You're awake? How are you? Still in pain? Hmm... It seems you are alright...",
                    "I found you collapsed on a cliff in the mountains. If I would have left you there, you'd be nothing but an ice cube by now. Thank you later...",
                    "Oh! How rude of me! Allow me to introduce myself. I am the hunter attached to this village... Or at least I used to be.",
                    "A wyvern attacked and injured me, forcing me into retirement. That is why we sent for you. You were to become my replacement.",
                    "Which left me in a jam when you collapsed up in the Snowy Mountains. I had no idea what I should do...",
                    "A new village with new things... I'm sure you have plenty of Questions to ask. I'm here to answer as many as I can.",
                    "I know it isn't much, but I'd like to give you a present. The old equipment I used when I was a hunter. Take a look inside your Item Box when you get home.",
                    "I wasn't sure what kind of weapon you use, so I put lots of different kinds in your item Box. They aren't great, but they should come in handy.",
                    "If nothing really strikes you as perfect, I recommend starting with the Sword. Keep using it untill you get used to being a hunter.",
                    "By the way, I put your clothes in the Item Box. What you've got on now is fine for the village, but put on your real clothes when venturing out.",
                    "They're great against the cold, so don't forget them if you go to the mountains. If you use other armor, bring items like a Hot Drink versus the cold."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "The first thing you must do is have a chat with the Village Chief. You aren't just in the service of the village, you are also in her service too.",
                    "You'll find that living in Pokke Village is quite easy. I'm not from here either, but I've decided to stay here when I retire.",
                    "If there is anything you don't understand about a hunter's lifestyle, feel free to ask me. I'll help you as much as I can."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "My first piece of advice is to go have a chat with the Village Chief."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Taking care of yourself? You look alright to me, but be careful not to overdo it. You've almost mastered all of the easy Quests, I guess.",
                    "You wouldn't happen to know the name of the kind of monster that attacked you on the way to this village, would you?",
                    "I didn't think you did! I don't even think the Guild has much information about the beast. I just found out about it recently myself!",
                    "Apparently the wyvern is know as a Tigrex. It doesn't appear to live in the Snowy Mountains, but has just been visiting them to prey on Popos.",
                    "Its legendary tiger-like roar and tyrannical behavior earned the Tigrex its fearsome name.",
                    "Be careful. There may be many mysteries surrounding the Tigrex, but its brutality is without question. You know, I once...",
                    "...Forget it. Anyways, be extremely careful if you head to the Snowy Mountains."
                ],
                "note": "after greeted the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Its legendary tiger-like roar and tyrannical behavior earned the Tigrex its fearsome name.",
                    "Reports say that its characteric wings date it as a predecessor to modern wyverns... But hunters have better things to worry about.",
                    "The thing we care about is the fact that it is an extremely brutal wyvern. Be very careful if you think you may encounter a Tigrex."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Treshi's disciple",
        "dialogues": [
            {
                "dialogue": [
                    "Hello there. You're the new hunter right? Pleased to meet you.",
                    "Let's see... The truth is that even though we've just met, I have a favor to ask of you.",
                    "Hmm... How do I put this? Well... The Village Chief said that you should go and check in with her. She seems quite worried about you.",
                    "Once you've talked to her, come back here. Also, if you've got the time, it would help if you went to speak to the master in the Gathering Hall."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Once you've talked to her, come back here. If you've got some spare time, it would help if you went to speak to the master in the Gathering Hall."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Ahh... Hello. I think this is the beginning of a beautiful friendship, which is why I'd like to ask you for a favor.",
                    "I forgot to introduce myself last time. I am Treshi's disciple. You know who Treshi is right? If not, you should go meet him in the Gathering Hall.",
                    "The favor that I want to ask actually comes from Treshi. You see, he has a farm, but no one to maintain it. We were hoping you'd be up for the job.",
                    "It's conveniently called Pokke Farm. Everything you need to start off, along with some Felyne labor, has already been provided.",
                    "Everything you farm, be it ore, fish, etc., is yours to use as you please. If you need to know how to reap the land, ask the Felynes in charge.",
                    "You can also make additions to the farm. If you help Treshi with various tasks you will be able to save Pokke Points to use on upgrades to the farm.",
                    "If you deliver Account Items at the end of a normal Quest, or if you take a Treasure Hunters Quest, you'll earn Pokke Points.",
                    "There are other ways to obtain points, but I'll tell you about those another time. By the way, I put the new issue of Hunting Life on your bookshelf.",
                    "It is filled with incredibly useful information. I'll deliver the new issue to your house if there is one. Best of luck to you now..."
                ],
                "note": "after greeted the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hello once again. As always, I am in your debt. How have you been these days?",
                    "Pokke Points aren't just used to expand the farm, they can also be traded for items."
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "If you need equipment for the farm, just let me know. As you progress through your life as a hunter, you should be able to add new equipment."
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Blacksmith",
        "dialogues": [
            {
                "dialogue": [
                    "Yo yo and hello! You're the new hunter, aren't you? I look forward to working with you in the future.",
                    "This is the Equipment Shop. It's two shops in one. The Weapons Shop sells completed items and the Crafing Shop makes or improves weapons and armor.",
                    "When you don't have materials you should visit the Weapons Shop and talk to that darn Felyne. All you need is money to buy armor or weapons from him!",
                    "Now if you got some materials and want to make new equipment, I'm your man! All you need is materials and money... I can make anything.",
                    "If you want to improve weapons and armor, I'm also your man. You'll need materials and money for bows or melee weapons. Bow guns only require money.",
                    "Improving armor will require speical materials and money... Huh? What materials you ask? I'll tell you about that later. Patience, grasshopper.",
                    "Oh, I forgot to mention Decorations. When it's time to add Skill Points to armor or weapons, I'm the man you need to see.",
                    "To be honest, it's not a stretch to say that hunters wouldn't be able to continue their vocation without my skills.",
                    "Anyways, if you happen across any new materials, you know where to come."
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Yo you and hello! For improving bone weapons you're gonna need bone material. Try a Popo for Brute Bone or a Giaprey to get some Small Monster Bone!"
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Ho ho, come back soon! Stop by anytime you've got some good materials!"
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Blacksmith Cat",
        "dialogues": [
            {
                "dialogue": [
                    "Meow! So you need new weapons or armor? Don't nya know that it is impurrtant that hunters have the best armor and weapons?",
                    "If you have materials, then the crafting shop next door can make something for you. But if not, then you'll have to buy your items brand new, meow!",
                    "I'll even sell you armor that they can't craft next door! Next time, I'll get some purrific armor for you, meow!",
                    "It's just right now our stocks are a little low, nya... But when you don't have materials, step right up! But buy a lot... I've gotta eat, meow!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hello... meow! So you need new weapons or armor? If you don't have materials, this is the purrfect place to buy them. What can I do for you, nya?"
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Thank you! Thank you! Come back soon, meow!"
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Village Merchant",
        "dialogues": [
            {
                "dialogue": [
                    "Well, hello there. You're the new hunter, right? This general store should have all of the various items you need.",
                    "We carry everything form daily necessities like Herbs to the various specialty items needed for a hunter's life. Let us know what you need.",
                    "Unfortunately ever since the last hunter retired, our normal supply routes have dried up... So we don't have our full compliment of stock.",
                    "That's why we've been looking for your arrival for so long. Your success will mean we will be able to return our stock to normal!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome! What can I do for you today? From everyday items to items essential for your hunt, we have everything you need!"
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Thank you. Come back soon."
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Villager 1",
        "dialogues": [
            {
                "dialogue": [
                    "Why hello there! You're the new hunter, right? Are you healed up from your injuries?",
                    "Have you said hello to the Village Chief yet?",
                    "She is the old lady near the fire in the back of the village."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "The little old lady near the fire at the back of the village is the Village Chief. Have you gone over to say hello yet?"
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hello and good day to you. It seems that you've fully recovered!",
                    "You know, we used quite a few Mountain Herbs on your wounds. Mountain Herbs are the specialty of the Snow Mountains near here.",
                    "Mountain Herbs are quite nutritious, but you can't just eat them off the ground. The Guid will buy them, since they are an Account Item.",
                    "You'll find many more herbs in the upper regions of the Snowy Mountains, like ridges or the summit, than in the foothills. Look in areas with grass."
                ],
                "note": "after greeted the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Mountain Herbs are quite nutritious, but you can't just eat them off the ground. The Guid will buy them, since they are an Account Item.",
                    "You'll find many more herbs in the upper regions of the Snowy Mountains, like ridges or the summit, than in the foothills. Look in areas with grass."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Villager 2",
        "dialogues": [
            {
                "dialogue": [
                    "Good day to you! You must be the hunter I just heard about. You're quite the topic of conversation in the village.",
                    "Have you met the Village Chief? Well, do you see the large blue rock of ore at the back of the open plaza?",
                    "The old lady next to that is actually the Village Chief. I think it would be best if you went over and said hello!"
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "The old lady standing next to the large blue rock of ore is the Village Chief. Don't forget to say hello to her."
                ],
                "note": "before greeting the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Oh, wait until you hear this story! You should learn important lessons form others, because this girl in front of me here obviously needs to!",
                    "She went out to find some Mountain Herbs by herself, but ran into a brutal monster called a Giadrome instead! Now what would you do?",
                    "Any ideas? A Giadrome can split icy liquid, freezing its prey and allowing it to attack at will, you know!",
                    "Well, if I were you, I would be really careful. Since you aren't at full strength, I'd recommend you run aways as fast as you can!",
                    "When it's time to run for your life, press the [R] button to dash with all your strength. Don't ever forget this, OK!?"
                ],
                "note": "after greeted the Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "A Giadrome can split icy liquid, freezing its prey and allowing it to attack at will, you know!",
                    "If the Giadrome has the upper hand, don't fight a losing battle, but instead run for your life. Press the [R] button to get out of there.",
                    ""
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Villager Cat",
        "dialogues": [
            {
                "dialogue": [
                    "Meow... What in the meow is going on? Ahh... Another hunter.",
                    "I dunno why, but it seems laterly all hunters do is come my way, nya.",
                    "That's why I save early and often in case something happens to me, meow!",
                    "If you want to save your data, nya, then just head to the bed in your house, meow! You will save while you're asleep.",
                    "You can also end without saving, but jsut make sure you don't pick that option by mistake or you'll regret it, meow!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "If you want to save, you should take a rest in the bed at your house, nya. While you are sleeping, the game data will be saved.",
                    "You can also end without saving, but jsut make sure you don't pick that option by mistake or you'll regret it, meow!"
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Elder Dragon Researcher",
        "dialogues": [
            {
                "dialogue": [
                    "Ho ho... You must be the hunter that was found collapsed on the Snowy Mountains. Ho ho ho...",
                    "Hmm... You don't look that beat up. Ho ho... I gues we can be expecting great things from you after all!",
                    "Me? You want to know about me? I'm just an old retiree. The Village Chief is the old lady over there.",
                    "Hey! Wait! Don't be in such a hurry there youngin'! Even though I'm just an old retiree, I might be of use to you!",
                    "Before I retired, I spent many years studying elder dragons as a member of the Observation Center. I am an expert on the subject, ho ho!",
                    "You don't have to worry about fighting any elder dragons in the near future, but if you need any information come and talk to me!"
                ],
                "note": "before greeting Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "Ho ho... So you want me to tell you some more, eh? Wanting to know more is an admirable trait.",
                    "The Elder Dragon Observation Center is an organization that tracks the movements of elder dragons, but you'lll probably never work with them.",
                    "Sometimes after you initiate a Quest, you may see a balloon floating off in the distance.",
                    "That would be one of the ways we track the dragons. Feel free to wave hello if you see one of the balloons."
                ],
                "note": "before greeting Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "The Elder Dragon Observation Center floats balloons in every part of the land to track the daily movements of elder dragons.",
                    "Feel free to wave hello if you see one of our balloons in the sky."
                ],
                "note": "after greeted Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "How are you doing today my hunting friend? Ho ho... I think it might be a little too soon for you to take on an elder dragon.",
                    "The most important thing for a hunter to do is live up to their potential. You should spend itme embarking on Quests and building up your power.",
                    "You can't just gain power through your equipment. You must be a master of weapons, bullets, items, resistances, and all special conditions."
                ],
                "note": "after greeted Village Chief",
                "rewards": []
            },
            {
                "dialogue": [
                    "I think it might be a little too soon for you to take on an elder dragon. First thing first, you must reach your maximum potential.",
                    "You can't just gain power through your equipment. You must be a master of weapons, bullets, items, resistances, and all special conditions."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Peddling Granny",
        "dialogues": [
            {
                "dialogue": [
                    "Greetin's I jus' happen to be a travelin' purveyor of fine goods. Some insist on sayin' I'm a peddler.",
                    "I'm stockin' up on ev'ryones unwanted items. If ya got anything you be wanting, speak up. I'll sell it to ya cheap.",
                    "Sometimes, I acquire me some good righ' cheap, so I sell 'em right cheap. Care to peruse my fine collection?"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Today I'm stockin' up on ev'ryones unwanted items. If ya got anything you be wanting, speak up."
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Oh I beg ya pardon! If somethin' 'appens give me a shout, eh?"
                ],
                "note": "adieu",
                "rewards": []
            },
            {
                "dialogue": [
                    "This lil' piggie right her' was born over in my place. Hey, ya' mind bein' the lil' porker's buddy for a bit?"
                ],
                "note": "interact with untamed Piggie",
                "rewards": []
            },
            {
                "dialogue": [
                    "Haha! It looks like the walkin' bac'n baby has taken a likin' to ya! I call 'im Piggie, and you can too. Take good of 'im, k?"
                ],
                "note": "after tamed Piggie",
                "rewards": [
                    "Piggie's Fashion"
                ]
            }
        ]
    },
    {
        "name": "Nekoht",
        "dialogues": [
            {
                "dialogue": [
                    "Hmm... So you are one of the hunters of this village, are you?",
                    "... I suppose you pass muster. However... it seems you still have much to learn, nya... *ahem* I mean, much to learn, yes.",
                    "You should take on some work form the granny over there. Surely, she has some jobs that will help you further develop your skills.",
                    "Once you feel more confident in your skill and prowess, come speak with me again. I may be of more help to you at that point."
                ],
                "note": "before clear elder 'A State of Crisis!'",
                "rewards": []
            }
        ]
    },
    {
        "name": "Village Chief",
        "dialogues": [
            {
                "dialogue": [
                    "Well well! It looks like you're all fixed up! When I heared that a hunter had fallen in the Snowy Mountains, I was so shocked!",
                    "Oh my... I haven't introduced myself! I'm the chief of this village. It's called Pokke. Can you believe an old lady like me can be village chief!?",
                    "I'm hoping I can convince you to settle down as a hunter in this village. You know the house you woke up in? You can stay there as long as you'd like.",
                    "Anyways... I'd like you to show me your strength by completing an easy Quest that was requeted nearby here. That's OK with you, right?",
                    "Huh? You're still recovering? Well, once you feel up to it, you can try some of the Quests from other areas. But first you should rest up a bit.",
                    "That reminds me, if you head to the \"Guild counter\", you can initiate various Quests. You see the large building on the left don't you?",
                    "That's the Gathering Hall. Inside you'll find a branch of the Hunter's Guild. If you want to take out a multiple hunter Quest, that's your best bet.",
                    "For details, head over and ask the person at the counter. Oh, I forgot to give you some money. It's not much, but it's enough to get started.",
                    "On the right you will find a general store that sells many great items. Next to that is a shop selling armor and waepons. go there for equipment needs.",
                    "If there's something you don't understand about hunting, go to the Training School. You see the path to the left of the Gathering Hall, right?",
                    "Go straight down that path and press the [X] button, to go to the Training School. If Quests are getting too hard, go there to toughen up!",
                    "Hmm... Well then... Good luck out there! Don't overdo it, OK!? I'm looking forward to watching your progress!"
                ],
                "note": "introduction",
                "rewards": [
                    "1500z"
                ]
            },
            {
                "dialogue": [
                    "I think you're warmed up by now, so let's take it easy. What level of Quest shall you go for?"
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "This Quest seems to be about the perfect level for you. Would you like to give it a try?"
                ],
                "note": "taking a quest, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "When you are ready to set off, head down the path in front of you and press the [X] button when you get to the entrance of the village, Good luck!"
                ],
                "note": "after taking a quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hmm... Giving up? If you change your mind, come back and visit me whenever you'd like. An old lady needs friends, ya' know!"
                ],
                "note": "adieu",
                "rewards": []
            },
            {
                "dialogue": [
                    "What's the matter? You'd like to cancel the Quest contract you took out?"
                ],
                "note": "greeting with a quest, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "That's too bad... I'll cancel this contract for you."
                ],
                "note": "sucessfully cancel a quest",
                "rewards": []
            }
        ]
    },
    {
        "name": "Instructor",
        "dialogues": [
            {
                "dialogue": [
                    "All Training Quests require you to slay your foe. Slay it, and training is complete. However, you must use set armor and weapons to finish the task!",
                    "I absolutely hate people who go on and on about a revival or two not being a bad thing! At this school even a single revival means defeat! Fools...",
                    "Along with the equipment I prepare, I also include some useful items. I've also placed some items out in the field! You have my permission to rummage.",
                    "As your instructor, I will give you a score upon completion of Quests. This score can be converted to Pokke Points and recorded on your Guild Card!",
                    "Cleaning Village Quests will unlock new Training Quests. Huh? Why the Village? Because the Chief will hurt me if I don't train you fully!",
                    "Mastering Battle Training will add new Training options! Of course, that' now the only thing you must do to add options, but it's a good start!",
                    "I can't let you in on the specifics, but trust me as your esteemed instructor that you'll know when the time comes! Now don't keep me waiting! Ha ha ha!",
                    "You can't take items you acquired during training back to the village, but you can take back Reward Items! Gather coins and tickets for a... Secret!"
                ],
                "note": "Solo Training -> School Rules -> Select",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome! Here at the Training School you will train to become the strongest hunter ever! Remember, an instructor's word is absolute!"
                ],
                "note": "Solo Training",
                "rewards": []
            },
            {
                "dialogue": [
                    "If you Item Bag is full, you will not be able to receive your reward. Place the contents of your Bag into the Item Box to free up some room."
                ],
                "note": "Arrange Item",
                "rewards": []
            },
            {
                "dialogue": [
                    "We follow our bylaws, and are fair about victory and defeat. If you want to hear the School Bylaws again, stop back at any time."
                ],
                "note": "Solo Training -> School Rules",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hmph. The Training School is closed. Please wait while the school is readied. Take this chance to train, like taking one of the Chief's Quests!"
                ],
                "note": "Solo Training -> No quest available",
                "rewards": []
            },
            {
                "dialogue": [
                    "When you are finished training, you can exit any time. Remember, the gates are always open! Come back whenever you wish to train some more."
                ],
                "note": "Solo Training -> Finsih Training",
                "rewards": []
            },
            {
                "dialogue": [
                    "Select this if you want to initiate a Quest! Just pick your Quest out like a true hunting connoisseur! After that, just wait for other hunters to join!"
                ],
                "note": "Group Training -> Initiate Quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "Group Training Quest for you by me, your esteemed instructor. It is harder than usual, but with a group of comrades, it shouldn't be too hard!"
                ],
                "note": "Group Training -> Initiate Quest -> Practice Quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "You can choose the Challenge Quests you have downloaded here! Let's see your real power! This isn't going to be easy!"
                ],
                "note": "Group Training -> Initiate Quest -> Challenge Quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "If you want to join a Quest started by another hunter, select this! This option is perfect if you have hunters who you trust to watch your back!"
                ],
                "note": "Group Training -> Join Quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "When you're ready to end your training, select this. However, you can always come back by returning to the Training School gate. I know you'll be back!"
                ],
                "note": "Group Training -> Finish Training",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome! This is Pokke Village's Beginners Training School! Here you can learn Hunter Basics, or throw yourself into the details of Weapon Usage."
                ],
                "note": "Beginner Train",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome to all those wishing to become hunters! Read this Hunter Knowledge closely, and depart on the lifeblood of a hunter, a Quest!",
                    "Before departing on a Quest, you must first initiate it. To initiate a Quest, you must pay a Contract Fee! Fee... That means money! Got it?",
                    "When clearing a Quest, you not only get your Contract Fee back, but also a Reward. But failure means you get absolutely nothing.",
                    "There are Quets that require no Contract Fee. For instance, my esteemed Quests! You need not worry about failure, and can try them as much as you like.",
                    "Make sure to check the Goal Condition before you initiate a Quest. Achieve it and you clear the Quest immediately, otherwise it continues on.",
                    "Beginner Training is nothing more than parctice Quests, so you can't take items back to the village afterwards! Sorry, gotta make a living somehow...",
                    "For Beginner Training, you aren't allowed to use your own equipment! I'll let you borrow mine, and prepare all of the items you'll need. Use them all!",
                    "During training, I'll give you Advice at various points. I'm sure you'd cry from frustration if I didn't, so pay close attention to my words!",
                    "The best way to learn the details of hunting is to try it all yourself. Let's go and take the first step in your hunting life! I've got high hopes!"
                ],
                "note": "Beginner Train -> Hunter Info",
                "rewards": []
            },
            {
                "dialogue": [
                    "When you are ready to end training, exit from here. But when you feel like getting back to the basics of hunting, the door is always open!"
                ],
                "note": "Beginner Train -> Finish Training",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Manager",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome to you! I've heard about you from the Village Chief. You must be the new hunter!",
                    "This is the counter for the Hunter's Guild Outpost here in Pokke Village. I am the Guild Manager here!",
                    "The Guild created these outposts to connect with hunters who do not have the ability to travel to large towns.",
                    "At this counter, multiple hunters can initiate Quests together. Of course, you can always initiate a Quest alone at this counter too.",
                    "However, to prevent you from taking a Quest that is far beyond your abilities, we have implemented a ranking system, called Hunter Rank.",
                    "Be aware that depending on your Hunter Rank, the Quests that you can take are different.",
                    "If you'd like more details on Hunter Rank, you should go talk to the maiden nearby.",
                    "Let's see now... What else do I have to explain to you? Ahh, that's right. How to enter the Gathering Hall!",
                    "There are two ways to enter the Gathering Hall. One is to press the [X] button and the other method is to press the [B] button.",
                    "Pressing the [X] button to enter will put you into the Offline Gathering Hall. When you'd like to do the Guild's work alone, use the [X] button.",
                    "Using the [B] button will enter you into the Online Gathering Hall. If you want to tackle a Guild Quest with your mates, use this option.",
                    "Oh, and you can only have up to a max of 4 hunter s per Gathering Hall at any time.",
                    "When you have 5 or more friends, you might want to press START to open the Menu and set your Online Gathering Hall option to \"MANUAL\".",
                    "By doing this, you can choose the number of the Gathering Hall you wish to join. Make sure the people you want to hunt with all choose the same one!",
                    "Conversely, when you have less than 4 hunters and manually choosing a Hall everytime is troublesome, you can set the option to \"AUTO\".",
                    "This is a good tip to remember when you want to do a quest in an area with a lot of other hunter nearby, go it?",
                    "Whew... That tired me out! If you didn't quite understand, ask the maiden close by here. The Guild is at your service!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hello! I hope all is well with you.",
                    "Today allow me to explain the remaining areas of departing on a Quest and Hunter Rank.",
                    "When you choose to depart on a Quest, there are two ways you can go about it.",
                    "One way of departing on a Quest is to sign up. When you want to initiate a Quest yourself, just talk with the girl at the reception counter.",
                    "The second method is to join a Quest. To the right of the door inside is a Quest Board that lists all of the currently open Quests you can take.",
                    "Speical requests require that you sign up for them yourself, so never fail to rise up to the challenge.",
                    "Hmm... What next... Ah, how to raise your Hunter Rank. You can raise your rank by completing specific level Quests from the Guild or the Chief.",
                    "If an Urgent Quest is requested, you'll be able to initiate it. Success will also cause your Hunter Rank to rise.",
                    "The specific Quests needed to rise in level are within one level. For instance, to rise to level 4, the Quests will be found onlyu in level 3.",
                    "Of course, if you plan on becoming stronger, you must challenge various Quests and gather assorted items to achieve your goal.",
                    "I must also mention Guild Points to you. If you save up these points, you may earn a Title.",
                    "There Titles appear on your Guild Card. It must be noted that Guild Points are in no way related to Hunter Rank."
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "There are two ways to raise your Hunter Rank: \n①: Challenge various Quests.\n②: Initiate specific Quests yourself.",
                    "Keep these in mind as you set out on your journey as a hunter. Of course, if you plan on becoming strong you must challenge a wide variety of Quests.",
                    "You can also earn Guild Points, which serve as a reward for your service to the Guild. If you save them, you can earn a speical Title."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Gal 1",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome to the Hunter's Guild Outpost in Pokke Village!",
                    "You must be the new hunter in town. Ever since the last hunter retired, I've been far from busy.",
                    "If you don't mind, allow me to start by explaining Quest Level. Did you know the level of a Quest is displayed by the number of ★ marks?",
                    "At this Gathering Hall, you can initiate Quest form level 1 to level 8, and the even harder G-Level Quests, which consists of LV G★ through LV G3★.",
                    "Quests are divided by difficulty into 4 grades: LV 1 and 2 are easy, LV3 through 5 are normal, and LV 6 through 8 are hard...",
                    "And finally, the hardest of all, the G-Level Quests - LV G★ through LV G3★. You can only initiate Low Rank Quests of levels 1 to 5 with me.",
                    "All hunters start with a Hunter Rank, or HR, of 1. A Hunter Rank of 1 allows you to initiate Quests from levels 1 to 3.",
                    "Level 1 and 2 Quests are primarily for practice against weaker monsters and are on teh same level as Quest from the Village Chief.",
                    "Just like other Quests, you can set off with up to 3 other hunters, making these Quests great for the inexperienced or just for some practice.",
                    "However, compared to Quests level 3 and above, the monsters here are weaker and you will not likely acquire high quality materials.",
                    "That is why there is no real need to initiate there Quests. If you trust in your skills, you can aim for higher level Quests.",
                    "Quests rated level 3 to 5 are known as Low Rank Quests. Within these levels, success at certain Quests will trigger an Urgent Quest.",
                    "If you succeed at these Urgent Quests. You will unlock the next level of Quests. If you rise above level 5, you'll unlock High Rank Quests.",
                    "These Quests feature powerful monsters taht require both great equipment and skill form the hunter involved, or even the help of comrades.",
                    "These difficulties come with a reward, as you can acquire high quality materials. You can initiate Hihg Rank Quests at the counter directly to my left.",
                    "Finally, if you can rise to a level higher than High Rank, you will be able to go to the counter near the fireplace and initiate G-Level Quests!",
                    "Hmm... Sorry if I was a bit long-winded. If you ever need to brush up on the details, you can review the info at the bookshelf in your home."
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome to the Hunter's Guild Outpost in Pokke Village! Please select the level of Quest you would like to initiate."
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Here are the Quests available at this time."
                ],
                "note": "initiating a quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "This Quest does not require a Contract Fee. Select this Quest?"
                ],
                "note": "selected a quest, 0z contract fee, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "This Quest requires a Contract Fee of [contract-fee]z. OK?"
                ],
                "note": "selected a quest, non-zero contract fee, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "Look for another Quest?"
                ],
                "note": "cancel selecting a quest, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "So you're heading off alone? Well, then may the light of luck shine upon you!"
                ],
                "note": "after taking a quest, solo",
                "rewards": []
            },
            {
                "dialogue": [
                    "Welcome to the Hunter's Guild Outpost in Pokke Village. You are contracted for the following Quest. Would you like to cancel the contract?"
                ],
                "note": "greeting with a quest, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "Contract canceled. We look forward to working with you again."
                ],
                "note": "sucessfully cancel a quest",
                "rewards": []
            },
            {
                "dialogue": [
                    "Thanks for vising the Hunter's Guild. We look forward to working with you again."
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Gal 2",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome to the Hunter's Guild!",
                    "This reception desk is for offering work to only the absolute best hunters.",
                    "Unfortunately, you just aren't quite up to the caliber of hunters we are looking for.",
                    "Please come back when you have improved your standing."
                ],
                "note": "below HR4",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Gal 3",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome to the G-Level Quest counter of the Hunter's Guild Outpost in Pokke Village!",
                    "This reception desk is for offering work to only the absolute best hunters who can tackle the quests beyond High Rank known as G-Level.",
                    "Unfortunately, you just aren't quite up to the caliber of hunters we are looking for.",
                    "Please come back when you have improved your standing."
                ],
                "note": "below HR7",
                "rewards": []
            }
        ]
    },
    {
        "name": "Female Hunter",
        "dialogues": [
            {
                "dialogue": [
                    "Hmph! You, huh? The dunce of a hunter who fell off a cliff on your way to this village by the order of the Guild!",
                    "All the hunters here and even the Village have high hopes for you... But you haven't proven anything to anyone yet!",
                    "Got it!? Well, here's some news for you. The Quests you can initiate over at that counter are separated into levels.",
                    "Level 1 and 2 Quests are for hunters wanting to face some weaklings not worthy to be called monsters. You won't get much reward of these.",
                    "Up to four hunters can head out on a Quest, so you and your friends can get beaten all black and blue together! Hmph!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Level 1 and 2 Quests are for hunters wanting to face some weaklings not worthy to be called monsters. You won't get much reward of these.",
                    "Up to four hunters can head out on a Quest, so you and your friends can get beaten all black and blue together! Hmph!"
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Merchant",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome to the Hunter's Shoppe at Pokke Village, here to support your hunting lifestyle. What can I do for you today?"
                ],
                "note": "greeting",
                "rewards": []
            },
            {
                "dialogue": [
                    "Thanks for shopping at the Hunter's Shoppe. Please come again."
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Treshi",
        "dialogues": [
            {
                "dialogue": [
                    "I'm Treshi. I've circled the globa on an endless hunt for treasure.",
                    "You do know about the existence of treasure, don't you?",
                    "I'm here to tell you of Quests that exist solely to find treasure, mate. These Quests are called Treasure Hunters Quests!",
                    "These treasure s are items so rare they can only be found during these Quests.",
                    "Taking off on a Treasure Hunters Quest is a bit different than a normal Quest.",
                    "First, you can only head off on a Treasure Hunter Quest with a maximum group of two hunters.",
                    "You can of course head off by yourself, but working alongside a mate will let you gather even more riches.",
                    "The second difference is a prohibition on personal items.",
                    "If you need items, you should get them just like you get treasure... By finding them in the field!",
                    "If you happen uponsome treasure, you should bring it back to me at camp.",
                    "I'll count up the treasure and reward each hunter with a split of the points you've earned.",
                    "Along with points, I'll also reward you with items. Generous, you say? Let's just say I'm living high on the hog, mate.",
                    "You can also be rewarded with points used to improve or expand Pokke Farm!",
                    "If you're after gathering up lots of Pokke Points, you'll find Treasure Hunters Quests to be of the utmost importance.",
                    "Now that you know the basics, I can truly call you my mate in the world of treasure hunting!",
                    "It is in your best interest to consult with me before you head out after treasure. I'll be waiting."
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hello Hello! Welcome Treasure Hunter! Please select the Quest you would like to initiate!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Alright, see ya soon!"
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Guild Cat",
        "dialogues": [
            {
                "dialogue": [
                    "Huh!? M-Master!?",
                    "I'm sorry, nya. I made a mistake... I thought you were someone else. Let me make it up to you by showing you around the Gathering Hall.",
                    "The girl at the back over there works for the Hunter's Shoppe. They sell lots of helpful items, meow.",
                    "To the left of the Hunter's Shoppe maiden is the Quest Board. There you can sign up for other hunter's Quests.",
                    "To the right of the maiden is a small Item Box, nya. You can't store equipment in there, but you can place other small items in there.",
                    "To the right of that box is an old man wearing a helmet. That is the one and only Treshi, meow!",
                    "Treshi's speical Treasure Hunters Quests have fantastic rewards in either cash or Pokke Points! YOu can do them alone, so try them out, nya!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "The exit in the back is where you can depart on a Quest once you've signed up for one or initiated for your own, meow.",
                    "One day, my master left through that very door, nya... He still hasn't come back.",
                    "Master... How long must I wait here for you, meow...?"
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Farm Manager Cat",
        "dialogues": [
            {
                "dialogue": [
                    "This is Pokke Farm, meow. Feel free to take away any of the items you find here.",
                    "This box here is a Small Item Box, nya. You can't put big things like equipment in it, but it is large enough to hold gathering items.",
                    "The Field, Fishing Spot, Mining Points, and Bug Catching area all have their own managers, so you should get details from them, nya.",
                    "I should also tell you that if you add a Mushroom Tree, you'll be able to gather Mushrooms under that roof you see on the left, meow.",
                    "You can also add a Bee Hive to the farm. It will be added to the area on the right, meow.",
                    "To gather up the items at each place, just press the [X] button. To add the new areas to the farm just ask the kid outside! Easy, nya!?"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "This is Pokke Farm, meow. Feel free to take away any of the items you find here.",
                    "If you replace a Mushroom Tree with a high quality version, you will be able to get many different kinds of Mushrooms, nya.",
                    "I bet you could even get some Mushrooms that you have never seen before, meow..."
                ],
                "note": "random",
                "rewards": []
            },
            {
                "dialogue": [
                    "This is Pokke Farm, meow. Feel free to take away any of the items you find here.",
                    "To make sure the establishments on the farm stay stocked, the number of times you can use them are limited, nya...",
                    "If you head off on a Quest, the items will replenish while you are away, so make sure to come back after a Quest, meow..."
                ],
                "note": "random",
                "rewards": []
            },
            {
                "dialogue": [
                    "This is Pokke Farm, meow. Feel free to take away any of the items you find here.",
                    "To gather up the items here, just walk up to one of the locations on the Fram and press the [X] button, nya.",
                    "If you need a Bugnet or a Pickaxe, we will get them ready for you, so just press the [X] button, nya. Pretty easy, meow?"
                ],
                "note": "random",
                "rewards": []
            }
        ]
    },
    {
        "name": "Mining Spot Cat",
        "dialogues": [
            {
                "dialogue": [
                    "This is a mining spot. I will lend you a Pickaxe for free, nya. So go mine as much as you can, meow!",
                    "Stand in front of the crack in that rock, and press the [X] button, meow. Do that and you will get some ore, nya.",
                    "If you gain Mining Points, you can climb to the rocks above this cliff using a ladder, meow.",
                    "It looks like there is a crack above the cliff here. If you extend the ladder, you'll be able to reach up there, meow!",
                    "Even if you come visit during a Quest, I will lend you a new Pickaxe, nya. Keep cracking those rocks, purr..."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Bug Catchign Spot Cat",
        "dialogues": [
            {
                "dialogue": [
                    "You can catch lots of bugs in this area, nya. If you don't have a Bugnet, I will lend you one for free! Catch lots of bugs, meow!",
                    "If you add a Insect Thicket, it will increase the number of times you can catch bugs, nya!",
                    "You can catch bugs by walking up to the bushes around here and pressing the [X] button, meow.",
                    "Even if you visit while on a Quest, I will be happy to lend you another Bugnet, meow. Now go catch lots of bugs, meow..."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Farming Field Cat",
        "dialogues": [
            {
                "dialogue": [
                    "This is a purrfect field. If you give me a seed, I will raise it until you come back nya. And not jsut seeds, I'll raise gress too, meow.",
                    "If you've got some Dung or Worms I can use as fertilizer, I'll spread them for you, nya! If the soil is fertile, the crops will increase, meow!",
                    "Once the crops grow, you can examine the rows and gather them up, meow. The more rows you have, the more rows you should examine!",
                    "Pick seeds or fertilizer, then decide which row you'd like me to work on and I'll do my magic! Do you want to work the land, meow?"
                ],
                "note": "introduction, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "Pick seeds or fertilizer, then decide which row you'd like me to work on and I'll do my magic! Do you want to work the land, meow?"
                ],
                "note": "select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "Alright, nya. If you have something for me to do in the field, just tell me, purrrrr."
                ],
                "note": "select [No] / successfully plant a seed",
                "rewards": []
            },
            {
                "dialogue": [
                    "I don't have any items to use, meow! I need to get some seeds or fertilizer!"
                ],
                "note": "select [Yes] & posses no seed",
                "rewards": []
            },
            {
                "dialogue": [
                    "You want me to use that item, nya!? If it's alright with you, I'll get to work!"
                ],
                "note": "select [Yes] & select a seed, select [Yes] / [No]",
                "rewards": []
            },
            {
                "dialogue": [
                    "Giving up, meow? If you give up now, everything will go back to how it was!"
                ],
                "note": "select [Yes] & select a seed & select [No], select [Yes] / [No]",
                "rewards": []
            }
        ]
    },
    {
        "name": "Fishing Spot Cat",
        "dialogues": [
            {
                "dialogue": [
                    "This is Fishing Spot, nya. You can catch some tasty fish here! I'll let you borrow some bait, so fish as much as you'd like meow!",
                    "Each time I lend you bait, it will be enough for three tries. But if you renovate the pier, I will give you even more bait, nya.",
                    "Go out onto the pier and press the [X] button to cast.",
                    "Even if you visit while on a Quest, I will be happy to lend you some more bait, meow. Now go catch some tasty fishes, meow..."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Cave Cat",
        "dialogues": [
            {
                "dialogue": [
                    "This is a storehouse made completely of natrual ice, meow. It is the purrfect place to store your perishables!",
                    "Actually... At the back of the storehouse there is something gaint, but only the Village Chief and Treshi know what it is, meow.",
                    "The two of them must be looking for a way to get at whatever is back there, nya...",
                    "I'm not sure what is really truth and what is rumor... All I know is that there is nothing you can do to get back there now, meow..."
                ],
                "note": "",
                "rewards": []
            }
        ]
    },
    {
        "name": "Cat Granny",
        "dialogues": [
            {
                "dialogue": [
                    "I'm the granny who takes care of getting these Felynes work. You are a hunter, aren't you?",
                    "How about trying some of these Felynes as workers?",
                    "I've got two types of working Felynes with me: Felyne Chefs who specialize in cooking, and Felyne Comrades who are a hunter's best friend.",
                    "Felyne Chefs are excellent cooks. If you hire them, you can eat the kind of gourmet meals that even boost your battle skills!",
                    "A hunter in your position should consider having a Felyne Chef in your employment. How about taking one out on a trial run?",
                    "Well, I guess the first Felyne will be on me. After that, you have to pay a finder's fee for any of these cats you hire.",
                    "By the way, I didn't bring any of them with me today, but I also have some Felyne Comrades for hire. They can accompany you on Quests.",
                    "But you can't bring them if it's a especially dangerous Quest, nor can you bring them if you're on a Quest with another hunter.",
                    "I'll tell you in more detail next time, I suppose. Remember that I'll always have either Chefs or Comrades in a row."
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Oh! How are you? I brought some Felynes that love to cook who are looking for work with me. If you see one you'd like to hire, just say so!"
                ],
                "note": "greeting, cook",
                "rewards": []
            },
            {
                "dialogue": [
                    "I'm sorry, but I must leave. I'll be back, so if you want to hire one then, just say so! I don't know when I'll be back though!",
                    "If you want to hire some Felyne Chefs, become a reliable hunter. Then I'll be happy to do business with you."
                ],
                "note": "adieu",
                "rewards": []
            }
        ]
    },
    {
        "name": "Cook Cat",
        "dialogues": [
            {
                "dialogue": [
                    "Welcome Gastronome! Thanks for hiring us, meow!",
                    "We're just going to use one of the rooms you aren't using anymore, nya. We promise to make you great food, so bon appetit, meow!",
                    "Food made by one Felyne is on the house, but if you add more staff to the kitchen we will charge you depending on the number of staff.",
                    "We look forward to having you order our tasty treats, nya!"
                ],
                "note": "introduction",
                "rewards": []
            },
            {
                "dialogue": [
                    "Hey Gastronome... Have you heard of Tranqulizer? It is important if you want to make Tranq Bombs or Tranq S, meow!",
                    "If you want to make some Tranquilizer, you should combine Sleep Herb with something like... say... a paralyzing mushroom, nya!"
                ],
                "note": "",
                "rewards": []
            }
        ]
    }
]